[
  {
    "recipeName": "Strawberry Pretzel Salad",
    "instructions": "Crush up your pretzels. Melt some butter. Add a cup of sugar to your melted butter and get it to disolve. Coat your crushed pretzels in the sugar butter. Put the pretzels in a 9x13 pan and bake at 350F until golden brown. Once ready, take out and let cool. Cream your tub of cream cheese and a cup of sugar. Fold your cool whip into the cream cheese mixture. Cover your cooled pretzels in the cream cheese cool whip mixture. Set in fridge to set. Prepare your jello mixture. Add your frozen strawberries to the warmed jello mixture to thaw. Let cool to room temperature. Carefully add the cooled jello mix to the top of your cream-cheese cool whip."
  },
  {
    "recipeName": "Fruit Salad",
    "instructions": "Let's make some fruit salad today (Uh-huh-uh) It's fun to do it's the healthy way (Uh-huh-uh) Take all the fruit that you want to eat It's going to be a fruit salad treat (The first step) Peel your bananas (The second step) Toss in some grapes (The third step) Chop up some apples, Chop up some melons And put them on your plate"
  },
  {
    "recipeName": "Citrus Seseme Kale",
    "instructions": "Heat sesame oil in a large skillet or wok over medium heat. Add ginger and garlic; cook for 30 seconds, or until fragrant, stirring constantly. Add kale and stir until coated with oil. Stir in soy sauce and orange juice; cover and cook for 3 minutes, or until kale is softened. Stir in sesame seeds and red pepper flakes (if using) and serve."
  },
  {
    "recipeName": "Buckwheat Noodle Pasta",
    "instructions": "Whisk together the vinegar, sugar, ginger, honey, tamari, sesame oil, and chili sauce in a large bowl until combined. Slowly whisk in the canola oil until the dressing is emulsified. Add the noodles, carrot, pepper, cucumber, green onions and cilantro. Gently mix to combine and serve."
  },
  {
    "recipeName": "Buckwheat Noodle Pasta",
    "instructions": "For the cauliflower: Preheat the oven to 425 degrees F. Remove the leaves from the cauliflower, then trim the stem flush with the bottom of the head so the cauliflower sits flat and upright. Transfer to a medium ovenproof skillet. Rub the outside of the cauliflower with the olive oil, then sprinkle evenly with the cumin, coriander, 1 teaspoon kosher salt and several grinds of pepper. Pour 1 cup water into the bottom of skillet, then wrap tightly with aluminum foil. Bake until the cauliflower is crisp-tender, 40 to 45 minutes. Remove the foil and continue to bake until the cauliflower is very tender and golden brown, 30 minutes more. (The core of the cauliflower should be tender but the whole head should hold its shape and not fall apart.) For the tahini sauce: Meanwhile, stir together the tahini, lemon juice, olive oil, cumin, garlic, 1/2 teaspoon kosher salt and several grinds of pepper until combined. Whisk in 3 to 4 tablespoons of water until the sauce is very smooth and creamy. The sauce may look lumpy at first, but will come together once the water is incorporated. Taste and adjust the seasoning with salt and pepper. Transfer the cauliflower to a serving platter, then top with the parsley, pine nuts, pomegranate seeds and a pinch of flaky sea salt. Drizzle with some of the tahini sauce, then cut into wedges and serve with more tahini sauce on the side. "
  }
]
